app/controllers/posts_controller.rb

	def update
		@post = Post.find(params[:id])

		if @post.update(params[:post].permit(:title, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Validated "], ["updated_at", "2015-11-28 01:41:57.876173"], ["id", 4]]